// *++
//
// Copyright 2005, Intel Corporation                                                         
// All rights reserved. This program and the accompanying materials                          
// are licensed and made available under the terms and conditions of the BSD License         
// which accompanies this distribution. The full text of the license may be found at         
// http://opensource.org/licenses/bsd-license.php                                            
//                                                                                           
// THE PROGRAM IS DISTRIBUTED UNDER THE BSD LICENSE ON AN "AS IS" BASIS,                     
// WITHOUT WARRANTIES OR REPRESENTATIONS OF ANY KIND, EITHER EXPRESS OR IMPLIED.             
// 
// Module Name:
//
//   ShellenvStrings.uni
// 
// Abstract:
// 
//   String definitions for the Shell shellenv command
// 
// Revision History:
// 
// --*/ 

/=#

#langdef   eng "English"

#string STR_SHELLENV_BATCH_CANNOT_EXECUTE #language eng  "shell: Cannot execute script - %r\n"

#string STR_SHELLENV_BATCH_ONE_VAR_E   #language eng  "%E"

#string STR_SHELLENV_BATCH_ONE_VAR_S   #language eng  "%s> "

#string STR_SHELLENV_BATCH_ONE_VAR_S_2 #language eng  "%s "

#string STR_SHELLENV_BATCH_ONE_VAR_N   #language eng  "%N"

#string STR_SHELLENV_BATCH_INTERNAL_ERROR #language eng  "Internal error\n"

#string STR_SHELLENV_BATCH_CANNOT_READ_FROM_FILE #language eng  "%HShell%N: Cannot read from file - %r\n"

#string STR_SHELLENV_BATCH_CANNOT_EXECUTE_2 #language eng  "%HShell%N: Cannot execute script - %r"

#string STR_SHELLENV_BATCH_ATTEMPT_JUMP #language eng  "%Hgoto%N: Attempt to jump into a loop(line %d)\n"

#string STR_SHELLENV_BATCH_NO_CORRESPONDING #language eng  "%hs: %s has no corresponding %s(line %d)\n"

#string STR_SHELLENV_CONIO_ONE_VAR_S_PTR #language eng  "%.*s"

#string STR_SHELLENV_CONIO_ENTER_CONTINUE #language eng  "%NPress ENTER to continue:%E"

#string STR_SHELLENV_CONIO_TWO_VARS_D_S #language eng  "%2d. %s\n"

#string STR_SHELLENV_DPROT_FUNCTION_DEVICE #language eng  "\n%N       Function (%hx) Device (%hx)"

#string STR_SHELLENV_DPROT_FUNCTION_NUMBER #language eng  "\n%N       Function Number (%hx)"

#string STR_SHELLENV_DPROT_MEMORY_TYPE #language eng  "\n%N       Memory Type (%d: %.lx-%.lx)"

#string STR_SHELLENV_DPROT_CONTROLLER_NUMBER #language eng  "\n%N       Controller Number (%d)"

#string STR_SHELLENV_DPROT_GUID        #language eng  "\n%N       Guid %g"

#string STR_SHELLENV_DPROT_HID_UID     #language eng  "\n%N       HID %hx, UID %hx"

#string STR_SHELLENV_DPROT_ATAPI       #language eng  "\n%N       ATAPI (%s, %s) LUN (%hx)"

#string STR_SHELLENV_DPROT_PUN_LUN     #language eng  "\n%N       SCSI (PUN %hx, LUN %hx)"

#string STR_SHELLENV_DPROT_FIBRE_CHANNEL #language eng  "\n%N       Fibre Channel (WWN %lx, LUN %lx)"

#string STR_SHELLENV_DPROT_GUID_2      #language eng  "\n%N       1394 (GUID %g)"

#string STR_SHELLENV_DPROT_USB         #language eng  "\n%N       USB (%hx, %hx)"

#string STR_SHELLENV_DPROT_USB_CLASS   #language eng  "\n%N       USB Class (Vendor ID: %hx, Product ID: %hx)"

#string STR_SHELLENV_DPROT_DEVICE      #language eng  "\n%N                 (Device: %hx, %hx, %hx)"

#string STR_SHELLENV_DPROT_I20         #language eng  "\n%N       I2O (%hx)"

#string STR_SHELLENV_DPROT_MAC         #language eng  "\n%N       MAC ("

#string STR_SHELLENV_DPROT_ONE_VAR_X   #language eng  "%02x"

#string STR_SHELLENV_DPROT_LOCAL       #language eng  "\n%N       IPv4 (Local IP: %d.%d.%d.%d:%d)"

#string STR_SHELLENV_DPROT_REMOVE_IP   #language eng  "\n%N            (Remote IP: %d.%d.%d.%d:%d)"

#string STR_SHELLENV_DPROT_PROTOCOL    #language eng  "\n%N            (Protocol: %hx)"

#string STR_SHELLENV_DPROT_SOURCE      #language eng  "\n%N            (Source IP: %s)"

#string STR_SHELLENV_DPROT_NOT_AVAIL   #language eng  "\n%N       IPv6 (Not Available)"

#string STR_SHELLENV_DPROT_MODE_GUID   #language eng  "\n%N       Infiniband (Node GUID: %lX IOC GUID: %lX)"

#string STR_SHELLENV_DPROT_DEVICE_ID   #language eng  "\n%N                  (DeviceId: %lX)"

#string STR_SHELLENV_DPROT_UART_DEFAULT #language eng  "\n%N       UART (DEFAULT %c"

#string STR_SHELLENV_DPROT_UART_D_C    #language eng  "\n%N       UART (%d %c"

#string STR_SHELLENV_DPROT_ONE_VAR_D   #language eng  " %d"

#string STR_SHELLENV_DPROT_GUID_G      #language eng  "\n%N       Guid %g"

#string STR_SHELLENV_DPROT_PARTITION_START_SIZE #language eng  "\n%N       Partition (%d) Start (%lX) Size (%lX)"

#string STR_SHELLENV_DPROT_BOOTENTRY_START_SIZE #language eng  "\n%N       BootEntry (%hx) Start (%lX) Size (%lX)"

#string STR_SHELLENV_DPROT_FILE        #language eng  "\n%N       File '%hs'"

#string STR_SHELLENV_DPROT_PROTOCOL_2  #language eng  "\n%N       Protocol '%hg'"

#string STR_SHELLENV_DPROT_DEVICE_PATH_FOR #language eng  "\n%N      %s Device Path for %s"

#string STR_SHELLENV_DPROT_DEVICE_PATH_ERROR #language eng  "\n%E      Device Path Error%N - Unknown Device Type"

#string STR_SHELLENV_DPROT_ASSTR       #language eng  "\n      AsStr:%N '%s'"

#string STR_SHELLENV_DPROT_DEVPATH     #language eng  "DevPath (%s)"

#string STR_SHELLENV_DPROT_ATTRIB_X    #language eng  "Attrib %hx"

#string STR_SHELLENV_DPROT_MODE        #language eng  "\n%N      %hc  mode %d: "

#string STR_SHELLENV_DPROT_ERROR       #language eng  "error %r\n"

#string STR_SHELLENV_DPROT_COL_ROW     #language eng  "col %3d row %3d"

#string STR_SHELLENV_DPROT_MID         #language eng  "%s%sMId:%hx "

#string STR_SHELLENV_DPROT_BSIZE_LBLOCK #language eng  "bsize %hx, lblock %lx (%,ld), %s %s %s"

#string STR_SHELLENV_DPROT_IMAGE_2     #language eng  "%HImage%N("

#string STR_SHELLENV_DPROT_IMAGE       #language eng  "%HImage%N(%s) " 

#string STR_SHELLENV_DPROT_HALL_DXE_SHELL #language eng  "%HAll/Dxe/Shell%N(%d(%d)/%d/%d)%HNum/Dxe/Shell%N(%d/%d/%d)"

#string STR_SHELLENV_DPROT_PEI         #language eng  "%HPei %N(%d) %HDxe %N(%d) "

#string STR_SHELLENV_DPROT_HSHELL      #language eng  "%HShell %N(%d)"

#string STR_SHELLENV_DPROT_FILE_3      #language eng  "  File:%H"

#string STR_SHELLENV_DPROT_ONE_VAR_N_NEW #language eng  "%N\n"

#string STR_SHELLENV_DPROT_FILE_2      #language eng  "  File:%hs\n"

#string STR_SHELLENV_DPROT_INTERNAL_IMAGE #language eng  "     %EInternal Image:%N %s\n"

#string STR_SHELLENV_DPROT_CODETYPE    #language eng  "     CodeType......: %s\n"

#string STR_SHELLENV_DPROT_DATATYPE_NEWLINE #language eng  "     DataType......: %s\n"

#string STR_SHELLENV_DPROT_PARENTHANDLE #language eng  "     ParentHandle..: %hx\n"

#string STR_SHELLENV_DPROT_SYSTEMTABLE #language eng  "     SystemTable...: %hx\n"

#string STR_SHELLENV_DPROT_DEVICEHANDLE #language eng  "     DeviceHandle..: %hx\n"

#string STR_SHELLENV_DPROT_FILEPATH    #language eng  "     FilePath......: %s\n"

#string STR_SHELLENV_DPROT_PDBFILENAME #language eng  "     PdbFileName...: %a\n"

#string STR_SHELLENV_DPROT_IMAGEBASE   #language eng  "     ImageBase.....: %hx - %hx\n"

#string STR_SHELLENV_DPROT_IMAGESIZE   #language eng  "     ImageSize.....: %lx\n"

#string STR_SHELLENV_DPROT_DATATYPE    #language eng  "     DataType......: %s"

#string STR_SHELLENV_DPROT_ROM_SIZE    #language eng  "     ROM Size......: %08x\n"

#string STR_SHELLENV_DPROT_ROM_LOCATION #language eng  "     ROM Location..: %08x\n"

#string STR_SHELLENV_DPROT_ISA_RESOURCE_LIST #language eng  "     ISA Resource List :\n"

#string STR_SHELLENV_DPROT_IO          #language eng  "       IO  : "

#string STR_SHELLENV_DPROT_MEM         #language eng  "       MEM : "

#string STR_SHELLENV_DPROT_DMA         #language eng  "       DMA : "

#string STR_SHELLENV_DPROT_INT         #language eng  "       INT : "

#string STR_SHELLENV_DPROT_ATTR        #language eng  "%08x           Attr : %08x\n"

#string STR_SHELLENV_DPROT_ATTR_2      #language eng  "%08x-%08x  Attr : %08x\n"

#string STR_SHELLENV_DPROT_SEGMENT     #language eng  "     Segment #.....: %hx\n"

#string STR_SHELLENV_DPROT_ATTRIBUTES  #language eng  "     Attributes....: %hx\n"

#string STR_SHELLENV_DPROT_SUPPORTS    #language eng  "     Supports......: %hx"

#string STR_SHELLENV_DPROT_TYPE_FLAG   #language eng  "      Type  Flag  Base              Limit             Gran\n"

#string STR_SHELLENV_DPROT_BUS         #language eng  "      BUS : "

#string STR_SHELLENV_DPROT_FOUR_VARS   #language eng  "%02x    %016lx  %016lx  %02x"

#string STR_SHELLENV_DPROT_SEGMENT_2   #language eng  "     Segment #.....: %02x\n"

#string STR_SHELLENV_DPROT_BUS_2       #language eng  "     Bus #.........: %02x\n"

#string STR_SHELLENV_DPROT_DEVICE_NUMBER #language eng  "     Device #......: %02x\n"

#string STR_SHELLENV_DPROT_FUNCTION_NUMBER_2 #language eng  "     Function #....: %02x\n"

#string STR_SHELLENV_DPROT_ROM_SIZE_2  #language eng  "     ROM Size......: %lx\n"

#string STR_SHELLENV_DPROT_VENDOR_ID   #language eng  "     Vendor ID.....: %04x\n"

#string STR_SHELLENV_DPROT_DEVICE_ID_2 #language eng  "     Device ID.....: %04x\n"

#string STR_SHELLENV_DPROT_CLASS_CODE  #language eng  "     Class Code....: %02x %02x %02x\n"

#string STR_SHELLENV_DPROT_CONFIG_HEADER #language eng  "     Configuration Header :"

#string STR_SHELLENV_DPROT_INTERFACE_NUMBER #language eng  "     Interface Number #.....: %02x\n"

#string STR_SHELLENV_DPROT_INTERFACE_CLASS #language eng  "     Interface Class #......: %02x\n"

#string STR_SHELLENV_DPROT_INTERFACE_SUBCLASS #language eng  "     Interface Subclass #...: %02x\n"

#string STR_SHELLENV_DPROT_INTERFACE_PROTOCOL #language eng  "     Interface Protocol #...: %02x\n"

#string STR_SHELLENV_DPROT_UNKNOWN     #language eng  "Unknown (%hx)"

#string STR_SHELLENV_DPROT_DRV_FILE    #language eng  "     Drv[%02x] File:%hs\n"

#string STR_SHELLENV_EXEC_RECURSIVE_ALIAS #language eng  "%HShell%N: Recursive alias or macro\n"

#string STR_SHELLENV_EXEC_FAIL_FIND_VAR #language eng  "%HShell%N: Fail to find variable - %r\n"

#string STR_SHELLENV_EXEC_INVALID_CHAR #language eng  "%HShell%N: Invalid char '%hx' in string\n"

#string STR_SHELLENV_EXEC_COULD_NOT_OPEN_OUTPUT #language eng  "%HShell%N: Could not open output file %hs\n"

#string STR_SHELLENV_EXEC_COULD_NOT_OPEN_ASCII #language eng  "%HShell%N: Could not append Ascii to Unicode %hs\n"

#string STR_SHELLENV_EXEC_COULD_NOT_APPEND_UNICODE #language eng  "%HShell%N: Could not append Unicode to Ascii %hs\n"

#string STR_SHELLENV_EXEC_ONE_VAR_N    #language eng  "%N"

#string STR_SHELLENV_EXEC_NOT_FOUND    #language eng  "'%es' is not recognized as an internal or external command, operable program or batch file\n"

#string STR_SHELLENV_EXEC_IMAGE_NOT_APP #language eng  "Image is not an application\n"

#string STR_SHELLENV_EXEC_EXIT_STATUS_CODE #language eng  "Exit status code: %r\n"

#string STR_SHELLENV_EXEC_INVALID_FILE_SYSTEM #language eng  "Invalid file system mapping on"

#string STR_SHELLENV_EXEC_INVLAID_MAPPING_NAME #language eng  "%HShell%N: Invalid mapping name - '%hs'\n"

#string STR_SHELLENV_EXEC_ONE_VAR_HS   #language eng  " %hs"

#string STR_SHELLENV_EXEC_DIRNOTALLOWED     #language eng  "%HShell%N: Could not output to directory %hs\n"

#string STR_SHELLENV_EXEC_INCORRECT_SYNTAX  #language eng  "%HShell%N: Incorrect redirection syntax\n"

#string STR_SHELLENV_EXEC_FILE_MULTIPLE #language eng  "%HShell%N: Could not output to file %hs Multiple times\n"

#string STR_SHELLENV_EXEC_FILE_CONLICT #language eng  "%HShell%N: Could not output to file %hs itself\n"

#string STR_SHELLENV_REDIR_CONLICT          #language eng  "%HShell%N: Redirection operators conflicted - '%hs'\n"

#string STR_SHELLENV_REDIR_SAME             #language eng  "%HShell%N: Redirection to the same file, contents maybe destroyed\n"

#string STR_SHELLENV_REDIR_NOT_ALLOWED      #language eng  "%HShell%N: Redirection not allowed for the command just executed.\n"

#string STR_SHELLENV_REDIR_MULTIPLE          #language eng  "%HShell%N: Duplicated redirection operator - '%hs'\n"

#string STR_SHELLENV_REDIR_LACK_VALUE       #language eng  "%HShell%N: Lack of file name of redirection operator - '%hs'\n"

#string STR_SHELLENV_REDIR_INCORRECT_SYNTAX #language eng  "%HShell%N: Incorrect redirection syntax - '%hs'\n"

#string STR_SHELLENV_EXEC_SOUTPUT_MULTIPLE  #language eng  "%HShell%N: Could not redirect standard output multiple times\n"

#string STR_SHELLENV_EXEC_SERROR_MULTIPLE   #language eng  "%HShell%N: Could not redirect standard error multiple times\n"

#string STR_SHELLENV_EXEC_TIMES_MULTIPLE   #language eng  "%HShell%N: Could not redirect more than 2 times\n"

#string STR_SHELLENV_EXEC_ONEREDIR_MULTIPLE   #language eng  "%HShell%N: Could not redirect to multiple files one time\n"

#string STR_SHELLENV_EXEC_ONE_VAR_HS   #language eng  " %hs"

#string STR_SHELLENV_REDIR_CANNOT_BE_SAME  #language eng  "%HShell%N: Standard output redirection file %hs can not be the\n"
                                                          "       same as error output redirection file %hs!\n"

#string STR_SHELLENV_ONLY_SCRIPT   #language eng  "%hs: Only supported in script files\n"

#string STR_SHELLENV_PROTID_ENTER_Q    #language eng  "Press ENTER to continue, 'q' to exit: "

#string STR_SHELLENV_PROTID_TEMPCOLUMN #language eng  "\r%*a\r"

#string STR_SHELLENV_PROTID_UNKNOWN_FLAG #language eng  "guid: Unknown flag %hs\n"

#string STR_SHELLENV_PROTID_FOURTEEN_VARS #language eng  "  %h-.*s : %08x-%04x-%04x-%02x%02x-%02x%02x%02x%02x%02x%02x  %c\n"

#string STR_SHELLENV_PROTID_ONE_VAR_HS_NO_SPACES #language eng  "%hs"

#string STR_SHELLENV_PROTID_CONTROLLER_NAME #language eng  "     Controller Name    : "

#string STR_SHELLENV_PROTID_UNKNOWN    #language eng  "%H<UNKNOWN>%N"

#string STR_SHELLENV_PROTID_DEV_PAATH  #language eng  "     Device Path        : %hs\n"

#string STR_SHELLENV_PROTID_DEV_PATH_2 #language eng  "     Device Path        : %H<NONE>%N\n"

#string STR_SHELLENV_PROTID_CONTROLLER_TYPE #language eng  "     Controller Type    : "

#string STR_SHELLENV_PROTID_ROOT       #language eng  "%HROOT%N\n"

#string STR_SHELLENV_PROTID_HBUS       #language eng  "%HBUS%N\n"

#string STR_SHELLENV_PROTID_HDEVICE    #language eng  "%HDEVICE%N\n"

#string STR_SHELLENV_PROTID_CONFIG_HYES #language eng  "     Configuration      : %HYES%N\n"

#string STR_SHELLENV_PROTID_CONFIG_HNO #language eng  "     Configuration      : %HNO%N\n"

#string STR_SHELLENV_PROTID_DIAG_HYES  #language eng  "     Diagnostics        : %HYES%N\n"

#string STR_SHELLENV_PROTID_DIAG_HNO   #language eng  "     Diagnostics        : %HNO%N\n"

#string STR_SHELLENV_PROTID_MANAGED_BY #language eng  "     Managed by :\n"

#string STR_SHELLENV_PROTID_DRV_IMAGE  #language eng  "       Drv[%h02x] : Image(%hs)\n"

#string STR_SHELLENV_PROTID_DRV_HS     #language eng  "       Drv[%h02x] : %hs\n"

#string STR_SHELLENV_PROTID_MANAGED_BY_NONE #language eng  "     Managed by         : %H<NONE>%N\n"

#string STR_SHELLENV_PROTID_PARENT_CONTROLLERS #language eng  "     Parent Controllers :\n"

#string STR_SHELLENV_PROTID_PARENT     #language eng  "       Parent[%h02x] : %hs\n"

#string STR_SHELLENV_PROTID_PARENT_CONT_NONE #language eng  "     Parent Controllers : %H<NONE>%N\n"

#string STR_SHELLENV_PROTID_CHILD_CONTROL #language eng  "     Child Controllers  :\n"

#string STR_SHELLENV_PROTID_CHILD      #language eng  "       Child[%h02x] : %hs\n"

#string STR_SHELLENV_PROTID_CHILD_CONTROL_NONE #language eng  "     Child Controllers  : %H<NONE>%N\n"

#string STR_SHELLENV_PROTID_DRIVER_NAME #language eng  "     Driver Name    : %hs\n"

#string STR_SHELLENV_PROTID_DRIVER_NAME_NONE #language eng  "     Driver Name    : %H<NONE>%N\n"

#string STR_SHELLENV_PROTID_IAMGE_NAME #language eng  "     Image Name     : %hs\n"

#string STR_SHELLENV_PROTID_IMAGE_NAME_NONE #language eng  "     Image Name     : %H<NONE>%N\n"

#string STR_SHELLENV_PROTID_DRIVER_VERSION #language eng  "     Driver Version : %h08x\n"

#string STR_SHELLENV_PROTID_DRIVER_TYPE_HBUS #language eng  "     Driver Type    : %HBUS%N\n"

#string STR_SHELLENV_PROTID_DRIVER_TYPE_HDEVICE #language eng  "     Driver Type    : %HDEVICE%N\n"

#string STR_SHELLENV_PROTID_DRIVER_TYPE_UNKNOWN #language eng  "     Driver Type    : %H<UNKNOWN>%N\n"

#string STR_SHELLENV_PROTID_CONFIG_HYES_2 #language eng  "     Configuration  : %HYES%N\n"

#string STR_SHELLENV_PROTID_CONFIG_HNO_2 #language eng  "     Configuration  : %HNO%N\n"

#string STR_SHELLENV_PROTID_DIAGNOSTICS_HYES #language eng  "     Diagnostics    : %HYES%N\n"

#string STR_SHELLENV_PROTID_DIAGNOSTICS_HNO #language eng  "     Diagnostics    : %HNO%N\n"

#string STR_SHELLENV_PROTID_MANAGING_NONE #language eng  "     Managing       : %H<NONE>%N\n"

#string STR_SHELLENV_PROTID_MANAGING   #language eng  "     Managing       :\n"

#string STR_SHELLENV_PROTID_CTRL_HS    #language eng  "       Ctrl[%h02x] : %hs\n"

#string STR_SHELLENV_PROTID_CHILD_HS   #language eng  "         Child[%h02x] : %hs\n"

#string STR_SHELLENV_PROTID_NHANDLE    #language eng  "%NHandle %h02x (%hX)\n"

#string STR_SHELLENV_PROTID_TWO_VARS_N #language eng  "%N %h2x: "

#string STR_SHELLENV_PROTID_TWO_VARS_HS #language eng  "   %hs (%hx) "

#string STR_SHELLENV_PROTID_ONE_VAR_HS #language eng  "%hs "

#string STR_SHELLENV_PROTID_TWO_VARS_HG_NEW #language eng  "   %hg (%08x)\n"

#string STR_SHELLENV_PROTID_ONE_VAR_HG #language eng  "   %hg \n"

#string STR_SHELLENV_PROTID_ONE_VAR_N  #language eng  "%N"

#string STR_SHELLENV_PROTID_ONE_VAR_N_NEWLINE #language eng  "%N\n"

#string STR_SHELLENV_PROTID_NHANDLE_DUMP #language eng  "%NHandle dump by protocol '%s'\n"

#string STR_SHELLENV_PROTID_PROTOCOL_NOT_FOUND #language eng  "dh: Protocol '%s' not found\n"

#string STR_SHELLENV_PROTID_INVALID_HANDLE_NUM #language eng  "dh: Invalid handle number %hs\n"

#string STR_SHELLENV_PROTID_HANDLE_DUMP #language eng  "%NHandle dump\n"

#string STR_SHELLENV_PROTID_CTRL       #language eng  "Ctrl[%h02x] "

#string STR_SHELLENV_PROTID_ONE_VAR_S  #language eng  "%s\n"

#string STR_SHELLENV_PROTID_UNKNOWN_2  #language eng  "<UNKNOWN>\n"

#string STR_SHELLENV_PROTID_NONE       #language eng  "None\n"

#string STR_SHELLENV_PROTID_STOP_CONTROLLER #language eng  "Stop Controller\n"

#string STR_SHELLENV_PROTID_ENTER_STOP_CONTROL #language eng  "\nPress [ENTER] to stop controller"

#string STR_SHELLENV_PROTID_CONTROLLER_STOPPED #language eng  "Controller stopped\n"

#string STR_SHELLENV_PROTID_RESTART_CONTROLLER #language eng  "Restart Controller\n"

#string STR_SHELLENV_PROTID_ENTER_RESTART_CONTROLLER #language eng  "\nPress [ENTER] to restart controller"

#string STR_SHELLENV_PROTID_CONTROLLER_RESTARTED #language eng  "Controller restarted\n"

#string STR_SHELLENV_PROTID_RESTART_PLATFORM #language eng  "Restart Platform\n"

#string STR_SHELLENV_PROTID_ENTER_RESTART_PLATFORM #language eng  "\nPress [ENTER] to restart platform"

#string STR_SHELLENV_PROTID_UNKNOWN_3  #language eng  "Unknown\n"

#string STR_SHELLENV_PROTID_FORCE_DEFAULT #language eng  "Force Default Configuration to DefaultType %08x\n"

#string STR_SHELLENV_PROTID_VALIDATE_CONFIG_OPTIONS #language eng  "Validate Configuration Options\n"

#string STR_SHELLENV_PROTID_SET_CONFIG_OPTIONS #language eng  "Set Configuration Options\n"

#string STR_SHELLENV_PROTID_CONFIGURABLE_COMPONENTS #language eng  "Configurable Components\n"

#string STR_SHELLENV_PROTID_DRV_CTRL_LANG #language eng  "  Drv[%h02x]  Ctrl[%h02x]  Lang[%ha]"

#string STR_SHELLENV_PROTID_DEFAULTS_FORCED #language eng  " - Defaults forced.  Action Required is "

#string STR_SHELLENV_PROTID_DEFAULTS_FORCE_FAILED #language eng  " - Force of defaults failed.  Status = %r\n"

#string STR_SHELLENV_PROTID_OPTIONS_VALID #language eng  " - Options valid\n"

#string STR_SHELLENV_PROTID_OPTIONS_NOT_VALID #language eng  " - Options not valid. Status = %r\n"

#string STR_SHELLENV_PROTID_OPTIONS_SET #language eng  " - Options set.  Action Required is "

#string STR_SHELLENV_PROTID_OPTIONS_NOT_SET #language eng  " - Options not set. Status = %r\n"

#string STR_SHELLENV_PROTID_DRV_CTRL_CHILD_LANG #language eng  "  Drv[%h02x]  Ctrl[%h02x]  Child[%h02x]  Lang[%ha]"

#string STR_SHELLENV_PROTID_FORCE_DEFAULTS_FAILED #language eng  " - Force of defaults failed.  Status = %r\n"

#string STR_SHELLENV_PROTID_HPASSED    #language eng  " - %HPASSED%N\n"

#string STR_SHELLENV_PROTID_HFAILED    #language eng  " - %HFAILED%N with %r\n"

#string STR_SHELLENV_PROTID_ERRORTYPE  #language eng  "    ErrorType = %g\n"

#string STR_SHELLENV_PROTID_BUFFERSIZE #language eng  "    BufferSize = %d\n"

#string STR_SHELLENV_PROTID_BUFFER_ONE_VAR #language eng  "    Buffer = %s\n"

#string STR_SHELLENV_PROTID_RUN_DIAGNOSTICS #language eng  "Run Diagnostics\n"

#string STR_SHELLENV_PROTID_AVAIL_DIAGNOSTICS #language eng  "Available Diagnostics\n"

#string STR_SHELLENV_PROTID_DRVDIAG_HANDLE_NOT_SUPPORT_PROT #language eng  "drvdiag: Driver image handle [%h02x] does not support Driver Diagnostics Protocol\n"

#string STR_SHELLENV_PROTID_DRVDIAG_HANDLE_NOT_SUPPORT_LANG #language eng  "drvdiag: Driver image handle [%h02x] does not support language %a\n"

#string STR_SHELLENV_PROTID_HC_T_DN    #language eng  "%HC  T   D%N\n"

#string STR_SHELLENV_PROTID_HT_Y_C_IN  #language eng  "%HT  Y C I%N\n"

#string STR_SHELLENV_PROTID_HR_P_F_AN  #language eng  "%HR  P F A%N\n"

#string STR_SHELLENV_PROTID_HL_ECGPDC_N #language eng  "%HL  E G G #P #D #C Device Name%N\n"

#string STR_SHELLENV_PROTID_H_EQUAL_SIGNS #language eng  "%H== = = = == == == =============================================================%N\n"

#string STR_SHELLENV_PROTID_ONE_VAR_H02 #language eng  "%h02x"

#string STR_SHELLENV_PROTID_ONE_VAR_D  #language eng  " %2d"

#string STR_SHELLENV_PROTID_ONE_VAR_S_SPACE #language eng  " %s\n"

#string STR_SHELLENV_PROTID_DRIVERS_UNKNOWN_FLAG #language eng  "drivers: Unknown flag %hs\n"

#string STR_SHELLENV_PROTID_DRIVERS_UNKNOWN_PARAM #language eng  "drivers: Unknown parameter %hs\n"

#string STR_SHELLENV_PROTID_H_T_DN     #language eng  "%H            T   D%N\n"

#string STR_SHELLENV_PROTID_HD_YC_IN   #language eng  "%HD           Y C I%N\n"

#string STR_SHELLENV_PROTID_HR_PF_AN   #language eng  "%HR           P F A%N\n"

#string STR_SHELLENV_PROTID_HV_VERSION #language eng  "%HV  VERSION  E G G #D #C DRIVER NAME                         IMAGE NAME%N\n"

#string STR_SHELLENV_PROTID_H_EQUAL_SIGNS_N #language eng  "%H== ======== = = = == == =================================== ===================%N\n"

#string STR_SHELLENV_PROTID_TWO_VARS_H_X #language eng  "%h02x %08x"

#string STR_SHELLENV_PROTID_ONE_VAR_S_2 #language eng  " %s"

#string STR_SHELLENV_PROTID_ONE_VAR_HS_NEWLINE #language eng  "%hs \n"

#string STR_SHELLENV_PROTID_DRV_CTRL_CNT #language eng  "  Drv[%h02x] Ctrl[  ] Cnt(%h02x) "

#string STR_SHELLENV_PROTID_DRV_CTRL_CNT_2 #language eng  "  Drv[%h02x] Ctrl[%h02x] Cnt(%h02x) "

#string STR_SHELLENV_VAR_UNKNOWN_FLAG  #language eng  "%hs: Unknown flag %hs\n"

#string STR_SHELLENV_VAR_INTERNAL_COMAMND #language eng  "%hs: %hs is an internal command.\n"

#string STR_SHELLENV_VAR_TOO_MANY_ARGS #language eng  "%hs: Too many arguments\n"

#string STR_SHELLENV_VAR_DUMP_VAR_LIST #language eng  "  %c %h-.*s : %s\n"

#string STR_SHELLENV_VAR_ENTER_Q       #language eng  "Press ENTER to continue, 'q' to exit: "

#string STR_SHELLENV_VAR_TEMPCOLUMN    #language eng  "\r%*a\r"

#string STR_SHELLENV_VAR_NOT_FOUND     #language eng  "%hs: %hs not found\n"

#string STR_SHELLENV_VAR_ALREADY_EXISTS_NONVOLATILE #language eng  "%hs: %hs already exists as a non-volatile variable\n"

#string STR_SHELLENV_VAR_ALREADY_EXISTS_VOLATILE #language eng  "%hs: %hs already exists as a volatile variable\n"

#string STR_SHELLENV_VAR_DISPLAY_VAR   #language eng  "%c %hs : %s\n"

#string STR_SHELLENV_WAIT_ONLY_SUPPORTED #language eng  "wait: Only supported in script files\n"

#string STR_SHELLENV_VAR_RESERVED      #language eng  "%hs: %hs is a reserved and volatile variable.\n"

#string STR_SHELLENV_VAR_MODE_OPTIONS  #language eng  "%HValid EFI Shell running modes are:%N\n"

